{
  "backend/main.mo": "Main Motoko actor defining all backend types (Employee, WorkDay, PayrollRecord, etc.) and exposing CRUD endpoints for employee management, payroll, payments, leave, and access control using OrderedMap collections.",
  "feature_evidence.json": "Feature evidence report linking the frontend data-fetching hooks fix (useQueries.ts, EmployeesPage, PaymentsPage) to its test requirement REQ-3 with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and key changes of each frontend source file in the project.",
  "frontend/index.html": "Root HTML entry point that mounts the React app into a div#root and loads the main TypeScript module.",
  "frontend/index.ts": "Minimal file containing a single Greek-language JSX heading element for the Employees page title.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient (staleTime:0), ThemeProvider, and tab-based routing across seven pages including the DataRecoveryPage.",
  "frontend/src/components/BulkEntryTable.tsx": "Scrollable table component for bulk monthly work-hour entry per employee and day, with inline editing and auto-save on blur or leave toggle.",
  "frontend/src/components/BulkLeaveDayDialog.tsx": "Dialog for recording a leave day for all employees at once by selecting a single date and calling the bulk leave mutation.",
  "frontend/src/components/BulkMonthlyBankSalaryDialog.tsx": "Inline or dialog component that renders a table of employees with input fields for their monthly bank salary amounts and saves them all in bulk.",
  "frontend/src/components/BulkPaymentEntryTable.tsx": "A table component for bulk entry of employee cash and bank payments for a selected month/year, with save functionality using the useAddPaymentsBulk hook.",
  "frontend/src/components/DailyBulkEntryTable.tsx": "A table component for bulk entry of daily work hours (normal, overtime, leave) for all employees on a selected date, saving via useSetWorkDaysBulk.",
  "frontend/src/components/EmployeeCard.tsx": "A card component displaying an employee's key details (name, type, salary, leave) with edit, delete, and folder-view action buttons.",
  "frontend/src/components/EmployeeDialog.tsx": "A dialog form component for adding or editing an employee, handling both monthly and hourly types with validation and mutation hooks.",
  "frontend/src/components/EmployeeFolderView.tsx": "A read-only dialog that displays a detailed employee profile including salary, leave, and contact information, with an edit shortcut button.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying the current year, app copyright, and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive navigation header with desktop and mobile menus, page navigation via callback props, and a dark/light theme toggle.",
  "frontend/src/components/LeaveDayDialog.tsx": "Dialog for recording a leave day for a selected employee on a chosen date, using the toggleLeaveDay mutation.",
  "frontend/src/components/LeaveEditDialog.tsx": "Dialog that lists all recorded leave days for a specific employee in descending order and allows deleting individual entries.",
  "frontend/src/components/MonthlyBankSalariesView.tsx": "View that displays monthly bank salary records grouped by employee for the current month/year, with per-entry delete support.",
  "frontend/src/components/MonthlyBankSalaryDialog.tsx": "Dialog for adding a new monthly bank salary entry by selecting an employee, month, year, and amount.",
  "frontend/src/components/MonthlyBankSalaryEditDialog.tsx": "Dialog for editing an existing monthly bank salary record's month, year, and amount, pre-populated from the provided salary object.",
  "frontend/src/components/MonthlyBankSalaryManager.tsx": "A card component that allows setting or updating a specific employee's monthly bank salary amount for a given month and year, with save functionality and current amount display.",
  "frontend/src/components/PaymentEditDialog.tsx": "A dialog form component for creating or editing employee payment records, supporting cash and bank payment fields, month/year selection, and payment date.",
  "frontend/src/components/ProfileSetupModal.tsx": "An empty/placeholder component file for a profile setup modal.",
  "frontend/src/components/UnauthorizedAccessScreen.tsx": "An empty/placeholder component file for an unauthorized access screen.",
  "frontend/src/components/WorkDayDialog.tsx": "A dialog component for recording an employee's work day, allowing input of normal hours, overtime hours, and leave status for a specific date.",
  "frontend/src/docs/employee-calendar-sync.md": "Documentation describing the bidirectional React Query cache invalidation strategy between individual and bulk work hour entry modes, ensuring both views stay synchronized without manual refresh.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor using the current Internet Identity, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines TypeScript interfaces for payroll data and provides React Query hooks (useQuery/useMutation) for CRUD operations on employees, work days, payments, leave records, and related entities, with localStorage helpers for local persistence.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light/dark theme tokens (colors, radius, sidebar, charts), and adds enhanced calendar component styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider for React Query and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/CalendarPage.tsx": "Page component for work-hour entry that provides month/year selectors and two tabs: monthly bulk entry (BulkEntryTable) and daily bulk entry (DailyBulkEntryTable).",
  "frontend/src/pages/DataRecoveryPage.tsx": "Page for exporting and importing all app localStorage data as a JSON backup file, with a summary view of stored keys and import/export status feedback.",
  "frontend/src/pages/EmployeesPage.tsx": "Page that lists employees with search, add/edit/delete actions, and a folder view, using useGetEmployees and useDeleteEmployee hooks with loading skeletons and confirmation dialogs.",
  "frontend/src/pages/LeavePage.tsx": "Page for managing employee leave that displays per-employee leave balance cards with filtering, and supports adding single or bulk leave days via dialog components.",
  "frontend/src/pages/LoginPage.tsx": "Login page component (content truncated/empty in provided source).",
  "frontend/src/pages/MonthlyBankSalariesPage.tsx": "Page for managing monthly bank salaries with month/year selectors and three tabs: bulk entry, individual per-employee entry, and a view tab.",
  "frontend/src/pages/PaymentsPage.tsx": "Page for managing employee payments with tabs for bulk entry and a monthly view showing cash/bank payment totals per employee, plus a dialog for adding new payments.",
  "frontend/src/pages/PayrollPage.tsx": "Payroll summary page showing monthly salary totals (overall, cash, bank) and per-employee payroll cards with a month/year selector.",
  "frontend/src/types.ts": "TypeScript interface definitions for all core domain models: Employee, WorkDay, PayrollRecord, LeaveRecord, PayrollBalance, PaymentRecord, MonthlyBankSalary, ChangeHistoryEntry, and PayrollData.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the HR/payroll app, known data-loss issue between versions, pending backend migration tasks (AR-1, AR-2), and a completed frontend data-fetching fix feature."
}