{
  "backend/main.mo": "Main Motoko actor defining all data types (Employee, WorkDay, PayrollRecord, etc.) and storage maps for a payroll management system, with imports for Stripe, access control, and HTTP outcalls.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files for build planning reference.",
  "frontend/index.html": "Root HTML entry point for the Vite/React app, mounting the React app into a div with id 'root' and loading main.tsx as a module.",
  "frontend/index.ts": "Minimal file containing a single JSX heading element for the Employees page title in Greek; appears to be a stub or fragment.",
  "frontend/src/App.tsx": "Root React component that manages page state and renders one of six pages (employees, monthlyBankSalaries, calendar, payroll, payments, leave) within a themed layout with header, footer, and toast notifications.",
  "frontend/src/components/BulkEntryTable.tsx": "Empty file placeholder for the BulkEntryTable component.",
  "frontend/src/components/BulkLeaveDayDialog.tsx": "Dialog component that allows adding a leave day for all employees simultaneously by selecting a date from a calendar picker.",
  "frontend/src/components/BulkMonthlyBankSalaryDialog.tsx": "Dialog for bulk-entering monthly bank salaries for all employees at once, with month/year selectors and per-employee amount inputs.",
  "frontend/src/components/BulkPaymentEntryTable.tsx": "Table component for entering cash and bank payment amounts for all employees in bulk for a selected date and month/year, saving via a single bulk mutation.",
  "frontend/src/components/DailyBulkEntryTable.tsx": "Renders a table for bulk entry of work hours and leave for all employees on a specific date, pre-filling from existing data and saving via a bulk mutation.",
  "frontend/src/components/EmployeeDialog.tsx": "Modal dialog for creating or editing an employee, with form fields for name, type (hourly/monthly), rates, leave days, and contact info including validation.",
  "frontend/src/components/EmployeeFolderView.tsx": "Read-only modal dialog displaying detailed employee info including salary, contact details, and change history, with an optional edit button.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with page links for the payroll app, a dark/light theme toggle, and a responsive mobile nav bar.",
  "frontend/src/components/LeaveDayDialog.tsx": "Dialog for selecting a date to toggle a leave day for a specific employee, using a calendar picker and a mutation hook.",
  "frontend/src/components/LeaveEditDialog.tsx": "Dialog that lists all recorded leave days for an employee grouped by year, allowing individual leave records to be deleted.",
  "frontend/src/components/MonthlyBankSalariesView.tsx": "Displays all monthly bank salaries grouped by employee, with edit and delete actions for each salary entry.",
  "frontend/src/components/MonthlyBankSalaryDialog.tsx": "Dialog form for adding a new monthly bank salary entry for a specific employee, with month, year, and amount inputs.",
  "frontend/src/components/MonthlyBankSalaryEditDialog.tsx": "Dialog form for editing an existing monthly bank salary record, pre-populated with the current salary's month, year, and amount.",
  "frontend/src/components/MonthlyBankSalaryManager.tsx": "Card component that shows an employee's default bank salary and provides a button to open the add monthly bank salary dialog.",
  "frontend/src/components/PaymentEditDialog.tsx": "Dialog form for editing an existing payment record's cash amount, bank amount, and payment date.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/UnauthorizedAccessScreen.tsx": "Empty file with no content.",
  "frontend/src/components/WorkDayDialog.tsx": "Dialog form for logging or editing a work day for an employee, supporting normal hours, overtime hours, and leave designation with type.",
  "frontend/src/docs/employee-calendar-sync.md": "Documents the bidirectional React Query cache invalidation strategy between Individual and Bulk work hour entry modes, explaining which query keys are invalidated on each mutation and why.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an anonymous or authenticated actor based on the current Internet Identity, and invalidating all dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, exposing login/logout functions and identity state via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the payroll backend, covering employees, work days, leave records, payroll data, and related entities with BigInt-to-number conversions.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light/dark theme tokens, and adds enhanced calendar component styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CalendarPage.tsx": "Calendar page component that renders individual per-employee and bulk daily work hour entry views, handling month navigation, day selection, and work day save/update via mutations.",
  "frontend/src/pages/EmployeesPage.tsx": "Displays a searchable list of employees with options to add, edit, delete, and view employee folders, using React Query hooks for CRUD operations and confirmation dialogs for destructive actions.",
  "frontend/src/pages/LeavePage.tsx": "Manages employee annual leave tracking by displaying used/remaining leave days per employee with inline editing, bulk updates, and a reset-all option, filtered by year.",
  "frontend/src/pages/LoginPage.tsx": "Empty file with no content.",
  "frontend/src/pages/MonthlyBankSalariesPage.tsx": "Provides a tabbed interface for managing monthly bank salaries, supporting bulk entry, individual entry, and a view tab with edit capability per employee.",
  "frontend/src/pages/PaymentsPage.tsx": "Handles recording and viewing employee cash and bank payments filtered by month/year, with support for individual entry, bulk entry, and editing/deleting existing payment records.",
  "frontend/src/pages/PayrollPage.tsx": "Renders a monthly payroll summary page allowing navigation by month and filtering by employee, calculating salary, payments, and balances based on hours worked and employee type.",
  "frontend/src/types.ts": "Defines all TypeScript interfaces for the payroll application (Employee, WorkDay, PayrollData, etc.) and the PayrollBackend interface with all backend method signatures mirroring the Motoko backend.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens (primary, sidebar, chart, etc.), border radius variables, accordion keyframe animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Tracks the project's current state (version 5), summarizing the goal of removing admin permission checks in the ICP/Motoko backend and pending feature requests around leave day payroll calculations."
}