{
  "backend/main.mo": "Main Motoko actor defining all backend logic including access control, employee management, payroll calculations, work days, payments, leave records, and HTTP outcalls/Stripe integration.",
  "feature_evidence.json": "Feature evidence report confirming that CalendarPage.tsx was restored to its version 227 layout with original tab structure, Greek labels, and component composition.",
  "frontend-file-summaries.txt": "Auto-generated JSON map of short summaries for every frontend source file, describing each component's purpose and notable implementation details.",
  "frontend/index.html": "Root HTML entry point for the React app, mounting the app into a div#root and loading src/main.tsx as an ES module.",
  "frontend/index.ts": "Minimal file containing a single JSX heading element for the Employees page title in Greek; likely a stub or leftover fragment.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, ThemeProvider, authentication gating, tab-based page routing across seven pages, and a profile setup modal.",
  "frontend/src/components/BulkEntryTable.tsx": "Monthly bulk work-hours entry table showing all employees as rows and days as columns, with inline normal/overtime hour inputs, leave checkboxes, and a save-all button that calls the bulk work days mutation.",
  "frontend/src/components/BulkLeaveDayDialog.tsx": "Dialog for recording a single leave date for all employees at once using the addBulkLeaveDay mutation.",
  "frontend/src/components/BulkMonthlyBankSalaryDialog.tsx": "Inline or dialog component displaying a table of all employees with text inputs for their monthly bank salary, saving all entries in bulk via setMonthlyBankSalariesBulk.",
  "frontend/src/components/BulkPaymentEntryTable.tsx": "Renders a table for bulk entry of cash and bank payments for all employees in a given month/year, pre-populating existing payment data and saving via a bulk mutation.",
  "frontend/src/components/DailyBulkEntryTable.tsx": "Renders a day-by-day bulk work hours entry table for all employees, persisting draft data to localStorage and saving finalized entries via a bulk mutation.",
  "frontend/src/components/EmployeeCard.tsx": "Displays a summary card for a single employee showing salary info, leave days, and contact details, with action buttons for edit, delete, and folder view.",
  "frontend/src/components/EmployeeDialog.tsx": "Modal dialog form for adding or editing an employee, handling validation and submission via add/update mutations with toast notifications.",
  "frontend/src/components/EmployeeFolderView.tsx": "Modal dialog displaying detailed employee information including salary, contact details, and change history, with an option to open the edit dialog.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the current year, app name, and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky app header with logo, desktop/mobile navigation for all pages, theme toggle, and Internet Identity login/logout controls.",
  "frontend/src/components/LeaveDayDialog.tsx": "Dialog for recording a leave day for a specific employee by selecting a date and calling the toggleLeaveDay mutation.",
  "frontend/src/components/LeaveEditDialog.tsx": "Dialog that lists all recorded leave days for an employee in descending order and allows deleting individual entries.",
  "frontend/src/components/MonthlyBankSalariesView.tsx": "Read-only view of all bank salary records for the current month/year, grouped by employee with totals and individual delete actions.",
  "frontend/src/components/MonthlyBankSalaryDialog.tsx": "Dialog form for creating a new bank salary entry by selecting an employee, month, year, and amount.",
  "frontend/src/components/MonthlyBankSalaryEditDialog.tsx": "Dialog for editing an existing MonthlyBankSalary record's month, year, and amount, pre-populated from the provided salary prop.",
  "frontend/src/components/MonthlyBankSalaryManager.tsx": "Card component for a single employee that shows their current bank salary total and provides an input to add a new salary entry for a given month/year.",
  "frontend/src/components/MonthlyPaymentsView.tsx": "Displays a list of payment records for a given month/year, showing employee name, payment date, cash and bank amounts, with the ability to delete individual payments.",
  "frontend/src/components/PaymentEditDialog.tsx": "A dialog form for creating a new payment record, allowing selection of employee, month, year, cash/bank amounts, and payment date.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking modal dialog that prompts a new user to enter their name and saves it as their profile before proceeding.",
  "frontend/src/components/UnauthorizedAccessScreen.tsx": "Empty file with no content or exports.",
  "frontend/src/components/WorkDayDialog.tsx": "A dialog for recording or editing an employee's work day entry, supporting normal hours, overtime hours, and leave day designation.",
  "frontend/src/docs/employee-calendar-sync.md": "Documents the React Query cache invalidation strategy for bidirectional synchronization between individual and bulk work hour entry modes, including which query keys are invalidated and why.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and persisted identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on employees, work days, payments, monthly bank salaries, and leave days, using a backend actor for employees and localStorage for other data.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light/dark theme tokens, and adds enhanced calendar component styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CalendarPage.tsx": "Page for recording employee work hours, offering month/year selection and two tabs: bulk monthly entry and daily bulk entry.",
  "frontend/src/pages/DataRecoveryPage.tsx": "Page for exporting and importing all app localStorage data as a JSON backup file, with a summary view of stored keys.",
  "frontend/src/pages/EmployeesPage.tsx": "Page that lists employees in a searchable card grid with options to add, edit, delete, and view individual employee folders.",
  "frontend/src/pages/LeavePage.tsx": "Page displaying per-employee leave day usage with progress bars, and dialogs for adding, editing, and bulk-managing leave days.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login landing page with a feature grid (employees, payments, calendar, etc.) and an Internet Identity login button that shows a spinner while authenticating.",
  "frontend/src/pages/MonthlyBankSalariesPage.tsx": "Page for managing monthly bank salaries with month/year selectors and three tabs: bulk entry, individual per-employee entry, and a view tab.",
  "frontend/src/pages/PaymentsPage.tsx": "Page for recording and viewing employee payments, showing cash/bank totals for the selected month/year and tabs for bulk entry and payment history view.",
  "frontend/src/pages/PayrollPage.tsx": "Payroll calculation page that displays summary cards (total salaries, cash/bank payments, remaining) and per-employee payroll data for a selected month/year.",
  "frontend/src/types.ts": "Defines all shared frontend TypeScript interfaces including Employee, WorkDay, PaymentRecord, MonthlyBankSalary, LeaveDay, PayrollData, and ChangeHistoryEntry.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, shadows, accordion animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the HR Payroll Manager project, noting a known issue where the Employee Calendar page (CalendarPage.tsx) is broken in v249 and needs to be restored to match the v227 format."
}