{
  "kind": "build_request",
  "title": "Restore Employee Calendar to Version 227 Format",
  "projectName": "HR Payroll Manager",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the Employee Calendar page (CalendarPage.tsx) to display exactly as it did in version 227. This includes restoring the original layout, tab structure (bulk entry and daily bulk entry views), month/year selectors, table/grid appearance, inline editing controls for normal hours, overtime, and leave toggles, and any styling or component composition that was changed after v227. Do not alter any other pages, components, or backend logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "ΔΙΟΡΘΩΣΕ ΤΟ ΗΜΕΡΟΛΟΓΙΟ ΕΡΓΑΖΟΜΕΝΩΝ ΩΣΤΕ ΝΑ ΕΜΦΑΝΙΖΕΤΑΙ ΜΕ ΤΗΝ ΜΟΡΦΗ ΠΟΥ ΥΠΗΡΧΕ ΣΤΗΝ ΕΚΔΟΣΗ 227",
          "ΜΗΝ ΑΛΛΑΞΕΙΣ ΤΙΠΟΤΑ ΑΛΛΟ"
        ]
      },
      "acceptanceCriteria": [
        "The Employee Calendar page visually matches the layout and structure from version 227.",
        "Month/year selectors are present and functional.",
        "Both the bulk entry tab (all employees × days grid) and the daily bulk entry tab are displayed correctly.",
        "Inline editing for normal hours, overtime hours, and leave toggles works as in v227.",
        "No other pages, components, or backend files are modified."
      ]
    }
  ],
  "constraints": [
    "Only modify files related to the Employee Calendar display (CalendarPage.tsx, BulkEntryTable.tsx, DailyBulkEntryTable.tsx, and any directly related calendar sub-components).",
    "Do not change any backend logic, data models, or non-calendar frontend pages."
  ],
  "nonGoals": [
    "Modifying the Payroll, Payments, Leave, or any other page.",
    "Adding new features to the calendar.",
    "Changing backend actor logic or data structures.",
    "Altering authentication or navigation components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}