{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Employee Calendar to Version 227 Format",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the Employee Calendar page (CalendarPage.tsx) to display exactly as it did in version 227, including original layout, tab structure, month/year selectors, table/grid appearance, inline editing controls, and styling",
      "acceptanceCriteria": [
        "The Employee Calendar page visually matches the layout and structure from version 227.",
        "Month/year selectors are present and functional.",
        "Both the bulk entry tab (all employees × days grid) and the daily bulk entry tab are displayed correctly.",
        "Inline editing for normal hours, overtime hours, and leave toggles works as in v227.",
        "No other pages, components, or backend files are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CalendarPage.tsx",
          "operation": "modify",
          "description": "Restore CalendarPage to version 227 structure: re-implement the original layout with month/year selectors at the top, restore the tab-based navigation between bulk entry and daily bulk entry views, ensure proper Greek locale labels (Ημερολόγιο Εργαζομένων, Μαζική Καταχώριση, Ημερήσια Μαζική Καταχώριση), and restore any styling or component composition that existed in v227. Verify that both tab views render correctly and that month/year state is properly passed to child components."
        },
        {
          "path": "frontend/src/components/BulkEntryTable.tsx",
          "operation": "modify",
          "description": "Restore BulkEntryTable to version 227 appearance: re-implement the original grid/table layout showing all employees as rows and days of the month as columns, restore inline editing controls for normal hours and overtime hours (likely input fields within cells), restore leave toggle functionality (checkboxes or switches per day), ensure proper column headers for days 1-31, restore any CSS classes or styling that was present in v227, and verify localStorage persistence and bulk save functionality matches v227 behavior."
        },
        {
          "path": "frontend/src/components/DailyBulkEntryTable.tsx",
          "operation": "modify",
          "description": "Restore DailyBulkEntryTable to version 227 appearance: re-implement the original day-by-day layout showing all employees in a list/table format for a single selected day, restore inline editing controls for normal hours, overtime hours, and leave status for each employee on that day, restore the day selector UI element, ensure proper table headers and row structure match v227, restore any styling or component composition from v227, and verify localStorage persistence and save functionality works as in v227."
        }
      ]
    }
  ]
}