{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "HR/payroll management app with employees, calendar hours, payments, leaves, and payroll calculations. User reports data loss between versions — previously added employees, payments, calendar hours, and leaves are not showing in the new version.",
  "architectural_notes": [
    "App manages employees, payments, calendar hours, leaves, and payroll calculations",
    "Data persistence must be maintained across versions — data added in previous builds must carry over"
  ],
  "known_issues": [
    "Data loss between versions: employees, payments, calendar hours, and leaves added in v227 are not visible in the latest version"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-verify-and-fix-the-frontend-data-fetching-hooks-usequeries-ts-so-that-all-pages-employees-calendar-payments-payroll-monthly-bank-salaries-and-leave-correctly-fetch-and-display-data-returned-by-the-upgraded-backend-with-no-stale-cache-or-identity-gating-issues-preventing-data-from-rendering",
      "title": "Verify and fix the frontend data-fetching hooks (useQueries.ts) so that all pages — Employees, Calendar, Payments, Payroll, Monthly Bank Salaries, and Leave — correctly fetch and display data returned by the upgraded backend, with no stale cache or identity-gating issues preventing data from rendering.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement a Motoko migration module (backend/migration.mo) that preserves and migrates existing stable state (employees, work days, payments, leave records, monthly bank salaries, and payroll records) from the previous actor version so that all data entered in earlier deployments (e.g., v227) remains accessible after upgrade.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Audit every state collection in backend/main.mo (employees, work days, payments, leave days, monthly bank salaries, payroll records) and ensure all are declared as `stable` variables backed by OrderedMap or equivalent stable structures, so no data is lost on canister upgrade.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "HR Payroll Manager",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}