{
  "backend/main.mo": "Main Motoko actor implementing a comprehensive payroll management system with employee records, work days, payroll calculations, leave tracking, payments, monthly bank salaries, change history, and access control using OrderedMaps for data storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, and hooks describing a React-based payroll management application with employee management, calendar work entry, payroll calculations, payments, and leave tracking features.",
  "frontend/index.html": "HTML entry point for the Payroll Management Application with a root div and module script reference to main.tsx.",
  "frontend/index.ts": "Fragment containing a single Greek heading element for 'Εργαζόμενοι' (Employees).",
  "frontend/src/App.tsx": "Root React component managing page navigation between six sections (employees, monthly bank salaries, calendar, payroll, payments, leave) with theme provider and toast notifications.",
  "frontend/src/components/BulkEntryTable.tsx": "Empty file placeholder for bulk work hours entry table component.",
  "frontend/src/components/BulkLeaveDayDialog.tsx": "Dialog component for adding a leave day to all employees at once with calendar date selection, displaying informational messages about 8-hour leave calculation and leave day deduction logic.",
  "frontend/src/components/BulkMonthlyBankSalaryDialog.tsx": "Dialog component for bulk entry of monthly bank salaries for all employees with month/year selection, table input for individual amounts, and validation to ensure at least one salary is entered before saving.",
  "frontend/src/components/BulkPaymentEntryTable.tsx": "Table component for bulk payment entry allowing cash and bank payment input for all employees on a selected date, with decimal parsing, validation, and bulk save functionality that filters out empty entries.",
  "frontend/src/components/DailyBulkEntryTable.tsx": "A table component for bulk entry of daily work hours (normal and overtime) and leave status for multiple employees on a selected date. Fetches and pre-fills existing work day data, supports comma/dot decimal separators, and saves changes via mutation.",
  "frontend/src/components/EmployeeDialog.tsx": "A dialog form for adding or editing employee details including name, type (monthly/hourly), salary rates, leave days, and contact information. Validates inputs, supports decimal parsing with comma/dot separators, and handles create/update mutations.",
  "frontend/src/components/EmployeeFolderView.tsx": "A detailed employee folder view dialog displaying comprehensive employee information, salary details, and change history log. Includes an edit button that opens the EmployeeDialog for modifications.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information and a credit link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "The main navigation header with tabs for different pages (employees, bank salaries, calendar, payroll, payments, leave) and a theme toggle button. Includes responsive mobile navigation.",
  "frontend/src/components/LeaveDayDialog.tsx": "A dialog for adding a leave day for a specific employee by selecting a date from a calendar. Displays a note about 8-hour leave calculation and calls toggleLeaveDay mutation.",
  "frontend/src/components/LeaveEditDialog.tsx": "A dialog displaying all leave days for an employee grouped by year with delete functionality. Shows confirmation dialog before deleting leave records and displays total leave day count.",
  "frontend/src/components/MonthlyBankSalariesView.tsx": "Displays a table of all monthly bank salaries filtered by month/year with edit and delete functionality. Fetches all employees and their bank salaries, showing employee names and types with action buttons.",
  "frontend/src/components/MonthlyBankSalaryDialog.tsx": "Dialog component for adding a new monthly bank salary entry for an employee. Includes month/year selectors and amount input with decimal parsing and validation.",
  "frontend/src/components/MonthlyBankSalaryEditDialog.tsx": "Dialog component for editing an existing monthly bank salary record. Allows updating month, year, and amount fields with form validation and mutation handling.",
  "frontend/src/components/MonthlyBankSalaryManager.tsx": "Card component that manages monthly bank salaries for a specific employee. Shows default salary and provides a button to open the add dialog, with an info alert about limited functionality.",
  "frontend/src/components/PaymentEditDialog.tsx": "Dialog for editing payment records with month/year selectors, cash/bank payment inputs, and a date picker. Handles decimal input parsing and formats dates to YYYY-MM-DD for backend.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/UnauthorizedAccessScreen.tsx": "Empty file with no content.",
  "frontend/src/components/WorkDayDialog.tsx": "Dialog for adding/editing work day entries with normal hours, overtime hours, and leave checkbox. Includes decimal input validation and special handling for leave days (8 hours default).",
  "frontend/src/docs/employee-calendar-sync.md": "Documentation describing bidirectional synchronization between Individual and Bulk work hour entry modes using React Query cache invalidation. Explains which query keys are invalidated for each mutation to ensure both calendar views stay synchronized.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication via Internet Identity. Invalidates and refetches all non-actor queries when the actor changes (e.g., on login/logout).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity persistence, and authentication state throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for data fetching and mutations (employees, work days, leave records, payroll, payments). Implements cache invalidation strategies to keep related data synchronized across the application.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, CSS custom properties for theming (light/dark modes), and enhanced calendar component styles for better visibility and user interaction.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CalendarPage.tsx": "Calendar page component with two view modes: individual employee calendar and daily bulk entry table. Manages employee selection, month navigation, and work day dialog for adding/editing hours.",
  "frontend/src/pages/EmployeesPage.tsx": "Displays and manages employees with search, add, edit, delete, and folder view functionality. Uses React Query hooks for data fetching and mutations with toast notifications.",
  "frontend/src/pages/LeavePage.tsx": "Manages employee annual leave records with inline editing of used days, bulk operations, and year filtering. Calculates remaining leave days based on employee totals and used days.",
  "frontend/src/pages/LoginPage.tsx": "Empty file with no content.",
  "frontend/src/pages/MonthlyBankSalariesPage.tsx": "Provides tabbed interface for bulk and individual monthly bank salary entry and viewing. Supports multiple entries per employee/month that are automatically summed in payroll.",
  "frontend/src/pages/PaymentsPage.tsx": "Manages cash and bank payments for employees with individual and bulk entry modes. Includes payment editing, deletion, and monthly/yearly filtering with date selection.",
  "frontend/src/pages/PayrollPage.tsx": "Displays payroll calculations for employees by month/year, showing salary breakdowns, payments, balances, and totals. Supports single employee or all-employees view with month navigation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state file defining feature requests to fix leave day calculations so they count as 8 regular work hours, with different handling for hourly vs monthly employees."
}