{
  "backend/main.mo": "Main actor defining payroll, employee, workday, leave, payment, and salary data types and initializing ordered maps for storing all backend state.",
  "backend/migration.mo": "Migration module converting old actor state to the new actor format by directly copying all stored maps and counters.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, and test IDs for frontend calendar synchronization behavior.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files used for build planning.",
  "frontend/index.html": "Basic HTML entry point mounting the frontend app and loading main.tsx.",
  "frontend/index.ts": "Contains a single React heading element for employees, likely placeholder or unused.",
  "frontend/src/App.tsx": "Main React app component managing page routing, theming, and layout structure.",
  "frontend/src/components/BulkEntryTable.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/BulkLeaveDayDialog.tsx": "Dialog component allowing selection of a date and adding a leave day for all employees via a bulk mutation.",
  "frontend/src/components/BulkMonthlyBankSalaryDialog.tsx": "Dialog for bulk setting monthly bank salaries for employees, supporting month/year selection and per-employee amount entry.",
  "frontend/src/components/BulkPaymentEntryTable.tsx": "Table UI for entering and saving bulk employee payment records for a selected date.",
  "frontend/src/components/DailyBulkEntryTable.tsx": "Displays and edits daily work-hour entries for all employees, pre-filling saved data and allowing bulk save.",
  "frontend/src/components/EmployeeDialog.tsx": "Dialog for creating or editing an employee with form validation and submission to backend.",
  "frontend/src/components/EmployeeFolderView.tsx": "Shows detailed employee info and change history with an option to open the edit dialog.",
  "frontend/src/components/Footer.tsx": "Simple footer component with branding and external link.",
  "frontend/src/components/Header.tsx": "Top navigation bar enabling page switching and theme toggling for the app.",
  "frontend/src/components/LeaveDayDialog.tsx": "Dialog for adding a leave day, allowing date selection and submitting a toggleLeaveDay mutation.",
  "frontend/src/components/LeaveEditDialog.tsx": "Displays and manages existing leave days by year, including deletion with confirmation.",
  "frontend/src/components/MonthlyBankSalariesView.tsx": "Shows all employees' monthly bank salaries for a selected month/year with edit and delete options.",
  "frontend/src/components/MonthlyBankSalaryDialog.tsx": "Form dialog to add a monthly bank salary entry with month, year, and amount validation.",
  "frontend/src/components/MonthlyBankSalaryEditDialog.tsx": "Dialog to edit an existing monthly bank salary entry, updating month, year, and amount.",
  "frontend/src/components/MonthlyBankSalaryManager.tsx": "Manager UI for adding monthly bank salaries per employee, showing default salary info.",
  "frontend/src/components/PaymentEditDialog.tsx": "Dialog component for editing a payment record, handling form state, date parsing, and saving updated payment data.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for a profile setup modal component.",
  "frontend/src/components/UnauthorizedAccessScreen.tsx": "Empty placeholder file for an unauthorized access screen component.",
  "frontend/src/components/WorkDayDialog.tsx": "Dialog for adding or editing a work day, validating hour inputs, formatting dates, and submitting data via mutation.",
  "frontend/src/docs/employee-calendar-sync.md": "Documentation explaining synchronization and cache invalidation between individual and bulk work‑day entry modes.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and persisted identity handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and helpers for fetching and mutating employee, work‑day, leave, payment, and payroll data.",
  "frontend/src/index.css": "Defines Tailwind base layers, CSS variables for light/dark themes, global styles, and enhanced calendar component classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and Internet Identity providers.",
  "frontend/src/pages/CalendarPage.tsx": "Implements an employee work‑day calendar with month navigation, employee selection, and work‑day dialog handling.",
  "frontend/src/pages/EmployeesPage.tsx": "Displays and manages employees with search, add/edit/delete dialogs, and folder view access.",
  "frontend/src/pages/LeavePage.tsx": "Manages employee leave balances with inline editing, yearly filtering, bulk updates, and reset functionality.",
  "frontend/src/pages/LoginPage.tsx": "Empty placeholder for the login page.",
  "frontend/src/pages/MonthlyBankSalariesPage.tsx": "Provides bulk and individual monthly salary entry dialogs plus a view of aggregated bank salary data.",
  "frontend/src/pages/PaymentsPage.tsx": "Renders the payments management UI, allowing employees’ monthly payments to be added, edited, deleted, and viewed with filtering by month, year, and employee.",
  "frontend/src/pages/PayrollPage.tsx": "Displays monthly payroll data for all or a single employee, including salary calculations, payments, and navigation between months.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend build.",
  "project_state.json": "Describes the project’s state and requirements for syncing employee work‑hour entries between individual and bulk views and ensuring payroll updates accordingly."
}