{
  "backend/main.mo": "Motoko canister implementing access control, employee data structures, and payroll-related types and maps.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files and components for an authorization‑error suppression feature.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend files describing routing, hooks, components, and UI behavior.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/index.ts": "Contains a single JSX heading element, likely incorrect or placeholder content.",
  "frontend/src/App.tsx": "Main React component managing page state, theme, routing, and layout structure.",
  "frontend/src/components/BulkEntryTable.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/BulkLeaveDayDialog.tsx": "Dialog allowing bulk leave-day assignment to all employees with date selection and mutation submission.",
  "frontend/src/components/BulkMonthlyBankSalaryDialog.tsx": "Dialog for setting monthly bank salaries in bulk, including month/year selection and per‑employee entry.",
  "frontend/src/components/BulkPaymentEntryTable.tsx": "Component for entering bulk cash and bank payments with date selection, per‑employee inputs, and bulk mutation save.",
  "frontend/src/components/DailyBulkEntryTable.tsx": "Renders a table for bulk daily work-hour entry, loading existing entries by date and allowing edits before saving to the backend.",
  "frontend/src/components/EmployeeDialog.tsx": "Displays a form for adding or editing an employee, validating input and submitting changes through API mutations.",
  "frontend/src/components/EmployeeFolderView.tsx": "Shows full employee details and change history in a dialog, with an option to open the edit form.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar providing page switching and a theme toggle, with mobile-friendly navigation.",
  "frontend/src/components/LeaveDayDialog.tsx": "Dialog for assigning a leave day to an employee by selecting a date and submitting it to the backend.",
  "frontend/src/components/LeaveEditDialog.tsx": "Dialog for viewing grouped leave days by year and deleting individual leave records for an employee.",
  "frontend/src/components/MonthlyBankSalariesView.tsx": "Lists monthly bank salaries for all employees by selected month/year with edit and delete options.",
  "frontend/src/components/MonthlyBankSalaryDialog.tsx": "Form dialog to add a monthly bank salary for an employee with validation.",
  "frontend/src/components/MonthlyBankSalaryEditDialog.tsx": "Dialog allowing editing of an existing monthly bank salary entry for an employee.",
  "frontend/src/components/MonthlyBankSalaryManager.tsx": "UI card allowing adding monthly bank salaries for a single employee; viewing/deleting not yet supported.",
  "frontend/src/components/PaymentEditDialog.tsx": "Dialog to edit a payment record including amounts, month/year, and payment date.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file placeholder for a profile setup modal component.",
  "frontend/src/components/UnauthorizedAccessScreen.tsx": "Empty file placeholder for an unauthorized access screen component.",
  "frontend/src/components/WorkDayDialog.tsx": "Dialog component for adding or editing a work day with validation, leave handling, and saving via React Query mutation.",
  "frontend/src/docs/employee-calendar-sync.md": "Documentation explaining React Query cache invalidation for syncing individual and bulk work-day entry modes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the authenticated identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and helpers for employees, work days, payroll, and leave data plus formatting utilities.",
  "frontend/src/index.css": "Tailwind setup defining theme variables and enhanced calendar styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point that initializes React Query, Internet Identity provider, and renders the root component.",
  "frontend/src/pages/CalendarPage.tsx": "Renders a monthly calendar for employees with selectable days, employee filtering, and work‑day dialogs, refetching data on changes.",
  "frontend/src/pages/EmployeesPage.tsx": "Displays and manages employees with search, add/edit/delete dialogs, and folder view access.",
  "frontend/src/pages/LeavePage.tsx": "Shows annual leave data per employee with inline editing, bulk actions, and reset capabilities.",
  "frontend/src/pages/LoginPage.tsx": "Empty login page placeholder.",
  "frontend/src/pages/MonthlyBankSalariesPage.tsx": "Manages monthly bank salary entries with bulk and individual dialogs and a view tab.",
  "frontend/src/pages/PaymentsPage.tsx": "Handles adding, editing, viewing, and deleting employee payment records by month and year.",
  "frontend/src/pages/PayrollPage.tsx": "React page that displays payroll data per month, supports employee filtering, navigation between months, and detailed salary calculations.",
  "frontend/src/utils/errors.ts": "Utility for normalizing and sanitizing error messages, especially removing authorization-related strings before UI display.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters, including fallback to sessionStorage and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin usage for the frontend UI.",
  "project_state.json": "Metadata describing project requirements, issues, and authorization-related fix requests for enabling open access and removing role-based errors."
}