{
  "kind": "build_request",
  "title": "Fix authorization errors so anyone with the link can add employees and use the app",
  "projectName": "Payroll Manager",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Update backend authorization so that opening the app and adding an employee works for any caller (including anonymous users), eliminating the runtime traps that produce the messages \"Unauthorized: Only users can perform this action\" and \"Unauthorized: Only admins can perform this action\" during normal use (especially the add-employee flow), while keeping admin-only restrictions intact for admin-only operations (e.g., updating/deleting employees, work day edits, Stripe configuration).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ΔΙΟΡΘΩΣΕ ΤΑ ΣΦΑΜΛΑΤΑ ONLY ADMIN ΚΑΙ ONLY USERS ACCESS AND CAN PERFROM THIS ACTION ... ΩΣΤΕ ... ΝΑ ΜΠΟΡΕΙ ΝΑ ΚΑΝΕΙ ΠΡΟΣΘΗΚΗ ΕΡΓΑΖΟΜΕΝΩΝ ΚΑΙ ΝΑ ΛΕΙΤΟΥΡΓΙΣΕΙ ΤΗΝ ΕΦΑΡΜΟΓΗ. ΜΗΝ ΑΛΛΑΞΕΙΣ ΤΙΠΟΤΑ ΑΛΛΟ ..."
        ]
      },
      "acceptanceCriteria": [
        "A user can open the app via link and successfully call backend methods required for the Employees page without receiving any \"Unauthorized: Only users...\" traps.",
        "Calling addEmployee from the frontend succeeds for non-admin/non-assigned users and does not return/trap with \"Unauthorized: Only users can perform this action\".",
        "Admin-only operations (those currently guarded by #admin checks, e.g., updateEmployeeWithChangeLog, deleteEmployee, addWorkDay, setStripeConfiguration) remain restricted and still fail for non-admin callers.",
        "No other backend behaviors (data validation, payroll recalculation side effects, ID assignment) are changed for addEmployee beyond the authorization behavior."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the frontend does not display the authorization error strings (e.g., \"Only users can perform this action\") during normal usage flows (especially employee creation) once backend authorization is corrected, without changing the UI layout/design or any existing features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ΔΙΟΡΘΩΣΕ ΤΑ ΣΦΑΜΛΑΤΑ ONLY ADMIN ΚΑΙ ONLY USERS ACCESS AND CAN PERFROM THIS ACTION ..."
        ]
      },
      "acceptanceCriteria": [
        "After the backend fix, adding an employee from the Employees page completes successfully and no authorization error toast/message is shown.",
        "No visual redesign or feature changes are introduced; the existing pages/components remain functionally the same aside from the removed blocking auth errors."
      ]
    }
  ],
  "constraints": [
    "Do not change any UI appearance, navigation, or features beyond what is necessary to eliminate the blocking authorization errors described by the user.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not relax or modify admin-only authorization rules for operations other than what is necessary to let any user add employees and use the app normally.",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new roles/permissions UI for managing admins/users.",
    "Adding third-party authentication providers or changing Internet Identity integration.",
    "Implementing new app features unrelated to fixing the reported authorization errors."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}